Tekla Open API Reference for Tekla Structures 2025
DeformingData Class
 The DeformingData class holds information about the deforming of parts. Deformed parts are parts that have been warped, cambered or shortened.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.DeformingData
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DeformingData
<SerializableAttribute>
Public NotInheritable Class DeformingData
The DeformingData type exposes the following members.
Constructors
Name | Description
DeformingData
 Instantiates a deforming data instance.
Top
Properties
Name | Description
Angle
 The angle of the part at its start point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0, and the value is 45 in the Angle2 field.
Angle2
 The angle of the part at its end point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0, and the value is 45 in the Angle2 field.
Cambering
 The degree of cambering.
Shortening
 The degree of shortening.
Top
Examples
 The following example inserts a deformed beam:
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           Beam MyBeam = new Beam();
           MyBeam.DeformingData.Angle = 0.0;
           MyBeam.DeformingData.Angle2 = 45.00;
           MyBeam.DeformingData.Cambering = 10.0;
           MyBeam.DeformingData.Shortening = 20.0;
           MyBeam.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace